Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: །མུ་སྟེགས་ངན་པའི་ཚོགས་རྣམས་ཀུན་གྱིས་དེ་མི་རྟོགས།
en: That is not realized by any among the outsiders,

source: ། དེ་ལ་ཚོར་མེད་སེམས་དང་ཡིད་ཀྱི་རྒྱུ་བ་མེད།
en: Though they arrest their feeling, thought, and mental processes.

source: །རྨད་བྱུང་ཆོས་ཀྱི་རྒྱལ་པོ་ལྷ་མི་མངོན་སུམ་དུ། །ལན་གསུམ་བཟླས་པ་ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་མང་པོ། །ཤིན་ཏུ་ཞི་བ་རང་བཞིན་རྣམ་དག་རབ་ཏུ་བསྐོར།
en: O Wonderful King of Dharma, you turned the wheel of Dharma before men and gods, With its threefold revolution, its manifold aspects, Its extreme peace, and its purity of nature;

source: །འཇིགས་པ་མི་མངའ་འཇིགས་བྲལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: We bow to you who are dauntless, knowing no fear!

source: །མ་འདྲེས་པ་ཡི་ཆོས་རྣམས་ངེས་པར་རབ་རྟོགས་པ། །འགྲོ་བ་ཐམས་ཅད་འདྲེན་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: We bow to you, leader of all living beings, Who fully manifests the special qualities!

source: །ཀུན་ཏུ་སྦྱོར་བའི་བཅིངས་པ་གཅོད་ལ་ཕྱག་འཚལ་ལོ།
en: We bow to you who have cut the bondage of all fetters!

source: །ཕ་རོལ་ཕྱིན་ནས་སྐམ་ལ་བཞུགས་ལ་ཕྱག་འཚལ་ལོ།
en: We bow to you who, having gone beyond, stand on firm ground!

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ལིད་ཙ་བཱི་གཞོན་ནུ་དཀོན་མཆོག་འབྱུང་གནས་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། ལེགས་སོ་ལེགས་སོ། །གཞོན་ནུ་
en: Upon this request, the Buddha gave his approval to the young Licchavi Ratnākara. “Good, good, young man!

source: ཁྱོད་གང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ལས་བརྩམས་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་འདྲི་བ་ལེགས་སོ།
en: Your question to the Tathāgata about the purification of the buddhafield is indeed good.

source: ། བཅོམ་ལྡན་འདས་ལེགས་སོ་
en: Very good, Lord,

source: བྱང་ཆུབ་སེམས་དཔའ་ཇི་ཙམ་དུ་སེམས་ཅན་རྣམས་ལ་རྒྱས་པར་བྱེད་པ་དེ་ཙམ་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་ཏོ།
en: A bodhisattva embraces a buddhafield to the same extent that he causes the development of living beings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་ནི་སེམས་ཅན་གྱི་དོན་ལས་བྱུང་བའི་ཕྱིར་རོ།
en: Noble son, a buddhafield of bodhisattvas springs from the aims of living beings.

source: ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཚུངས་པར་ཤེས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་ཇི་ལྟ་བུར་བྱ་བར་འདོད་པ་
en: In just the same way, should a bodhisattva, who knows full well that all things are like empty space, wish to build a buddhafield in order to develop living beings,

source: དེ་ལྟ་བུར་སངས་རྒྱས་ཀྱི་ཞིང་བྱེད་མོད་ཀྱི། སངས་རྒྱས་ཀྱི་ཞིང་ནམ་མཁར་ནི་བྱར་མི་རུང་ཞིང་བརྒྱན་དུ་མི་རུང་ངོ་།
en: he might go ahead, in spite of the fact that it is not possible to build or to adorn a buddhafield in empty space.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ལ་གནས་པའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings who live by love, compassion, joy, and impartiality will be born in his buddhafield.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་སྒྲུབ་པ་ཤེས་པའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: Living beings who devote their efforts to the four foci of mindfulness, the four right efforts, the four bases of magical power, the five spiritual faculties, the five strengths, the seven factors of enlightenment, and the eight branches of the holy path will be born in his buddhafield.

source: དེ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་ཚེ་ངེས་པ་དང་། ལོངས་སྤྱོད་ཆེ་བ་དང་། ཚངས་པར་སྤྱོད་པ་དང་། བདེན་པའི་རྗེས་སུ་འཇུག་པའི་ཚིག་གིས་བརྒྱན་པ་དང་། ངག་འཇམ་པ་དང་། འཁོར་མི་ཕྱེད་པ་དང་། བྱེ་བ་སྡུམ་པ་ལ་མཁས་པ་དང་། ཕྲག་དོག་དང་བྲལ་བ་དང་། གནོད་སེམས་ཀྱི་སེམས་མེད་པ་དང་། ཡང་དག་པར་ལྟ་བ་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་སྐྱེ་བར་འགྱུར་རོ།
en: When he attains enlightenment, living beings who are secure in long life, great in wealth, chaste in conduct, enhanced by true speech, soft-spoken, free of divisive intrigues and adroit in reconciling factions, enlightening in their conversations, free of envy, free of malice, and endowed with perfect views will be born in his buddhafield.

source: ཞིང་ཡོངས་སུ་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཡོངས་སུ་དག་པ་ཡང་དེ་བཞིན་ནོ།
en: The purity of his buddhafield reflects the purity of living beings;

source: །སེམས་ཅན་ཡོངས་སུ་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡེ་ཤེས་ཡོངས་སུ་དག་པ་ཡང་དེ་བཞིན་ནོ།
en: the purity of the living beings reflects the purity of his gnosis;

source: །ཡེ་ཤེས་ཡོངས་སུ་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་བསྟན་པ་ཡོངས་སུ་དག་པ་ཡང་དེ་བཞིན་ནོ།
en: the purity of his gnosis reflects the purity of his doctrine;

source: །བསྟན་པ་ཡོངས་སུ་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡེ་ཤེས་བསྒྲུབས་པ་ཡོངས་སུ་དག་པ་ཡང་དེ་བཞིན་ནོ།
en: the purity of his doctrine reflects the purity of his transcendental practice;

source: །ཡེ་ཤེས་བསྒྲུབས་པ་ཡོངས་སུ་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རང་གི་སེམས་ཡོངས་སུ་དག་པ་ཡང་དེ་བཞིན་ཏེ།
en: and the purity of his transcendental practice reflects the purity of his own mind.

source: མ་ཐག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་དུ་མ་བརྩེགས་པ་དང་།
en: and suddenly it was transformed into a huge mass of precious jewels,

source: བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །སྔོན་མ་མཐོང་མ་ཐོས་པའི་བཀོད་པ་འདི་དག་གདའོ།
en: I see it, Lord! Here before me is a display of splendor such as I never before heard of or beheld!

source: སེམས་ཅན་སྡང་བ་དང་། རབ་ཏུ་སྡང་བ་དང་། གནོད་སེམས་ཅན་དང་། ཚུལ་ཁྲིམས་འཆལ་པ་དང་། ཁྲོ་བའི་སེམས་ཅན་རྣམས་བསྡུ་བའི་ཕྱིར་བཟོད་པ་དང་དུལ་བ་ཐོབ་པ།
en: He maintained tolerance and self-control in order to reconcile beings who were angry, cruel, violent, and brutal.

source: ཁྱིམ་གྱི་གནས་ན་གནས་ལ་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་དང་། མ་འདྲེས་པ།
en: He lived at home, but remained aloof from the realm of desire, the realm of pure matter, and the immaterial realm.

source: བུ་དང་། ཆུང་མ་དང་། སླས་རྣམས་ཀྱང་རྟག་ཏུ་ཚངས་པར་སྤྱོད་པ།
en: He had a son, a wife, and female attendants, yet always maintained continence.

source: གཡོག་བྲན་གྱིས་ཡོངས་སུ་བསྐོར་བར་སྣང་ཡང་རབ་ཏུ་དབེན་པར་སྤྱོད་པ།
en: He appeared to be surrounded by servants, yet lived in solitude.

source: །དེ་ཐབས་ལ་མཁས་པས་བདག་ཉིད་ན་བ་ལྟ་བུར་བསྟན་ནས་
en: At that time, out of this very skill in liberative art, Vimalakīrti manifested himself as if sick.

source: དེ་ལ་ནད་འདྲི་བའི་ཕྱིར་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་རྒྱལ་པོ་དང་། བློན་པོ་དང་། དབང་པོ་དང་། གཞོན་ནུའི་འཁོར་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དང་། ཚོང་དཔོན་དང་། གྲོང་པ་དང་། ཡུལ་གྱི་མི་དང་། དེ་མ་ཡིན་པ་སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ་ནད་འདྲིར་འོངས་ཏེ།
en: To inquire after his health, the king, the officials, the lords, the youths, the brahmins, the householders, the businessmen, the townfolk, the countryfolk, and thousands of other living beings came forth from the great city of Vaiśālī and called on the invalid.

source: །ལུས་འདི་ནི་ས་དང་འདྲ་སྟེ་བྱེད་པ་མེད་པའོ། །ལུས་འདི་ནི་ཆུ་དང་འདྲ་སྟེ་བདག་མེད་པའོ། །ལུས་འདི་ནི་མེ་དང་འདྲ་སྟེ་སྲོག་མེད་པའོ། །ལུས་འདི་ནི་རླུང་དང་འདྲ་སྟེ་གང་ཟག་མེད་པའོ། །ལུས་འདི་ནི་ནམ་མཁའ་དང་འདྲ་སྟེ་རང་བཞིན་མེད་པའོ།
en: This body is inert, like the earth; selfless, like water; lifeless, like fire; impersonal, like the wind; and nonsubstantial, like space.

source: ཁྱོད་ཀྱིས་དེ་ལྟ་བུའི་ལུས་དེ་ལ་ཡིད་བྱུང་བ་དང་སྐྱོ་བ་བསྐྱེད་ཅིང་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་མོས་པ་བསྐྱེད་པར་བགྱིའོ།
en: Therefore, you should be repelled by such a body. You should despair of it and should arouse your admiration for the body of the Tathāgata.

source: བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ལས་སྐྱེས་པ།
en: It is born of the concentrations, the liberations, the meditations, and the absorptions.

source: ཐོས་པ་དང་། ཤེས་རབ་དང་། ཐབས་ལས་སྐྱེས་པ།
en: It is born of learning, wisdom, and liberative art.

source: སྟོབས་བཅུ་ལས་སྐྱེས་པ། མི་འཇིགས་པ་བཞི་ལས་སྐྱེས་པ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ལས་སྐྱེས་པ།
en: It is born of the ten powers, the four fearlessnesses, and the eighteen special qualities.

source: མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤོང་བ་ལས་སྐྱེས་པ། དགེ་བའི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྡུད་པ་ལས་སྐྱེས་པ།
en: It is born of the abandonment of all evil qualities, and of the gathering of all good qualities.

source: ཡང་དག་པ་ཉིད་ལས་སྐྱེས་པ། བག་ཡོད་པ་ལས་སྐྱེས་པའོ།
en: It is born of reality. It is born of conscious awareness.

source: །གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་དགེ་བའི་ལས་ཚད་མེད་པ་ལས་སྐྱེས་པ་སྟེ།
en: Friends, the body of a tathāgata is born of innumerable good works.

source: ཁྱེད་ཀྱིས་དེ་ལྟ་བུའི་སྐུ་དེ་ལ་མོས་པ་བསྐྱེད་པར་བྱའོ།
en: Toward such a body you should turn your aspirations,

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་བསོད་ནམས་ལས་སྐྱེས་པ། སྦྱིན་པ་ལས་སྐྱེས་པ། ཚུལ་ཁྲིམས་ལས་སྐྱེས་པ། ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པ། ཤེས་རབ་ལས་སྐྱེས་པ། རྣམ་པར་གྲོལ་བ་ལས་སྐྱེས་པ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ལས་སྐྱེས་པ།
en: The body of a tathāgata is born of the stores of merit and wisdom. It is born of morality, of concentration, of wisdom, of the liberations, and of the knowledge and vision of liberation.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་ནད་རབ་ཏུ་སྤང་བའི་ཕྱིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བྱའོ།
en: and, in order to eliminate the sicknesses of the passions of all living beings, you should conceive the spirit of unexcelled, perfect enlightenment.

source: །དེ་བཞིན་དུ་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པས་དེ་ལྟར་ནད་འདྲི་བའི་ཚོགས་པ་དེ་དག་ལ་ཇི་ནས་
en: While the Licchavi Vimalakīrti thus taught the Dharma to those who had come to inquire about his sickness,

source: སེམས་ཅན་བརྒྱ་སྟོང་མང་པོ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་ལྟ་དེ་ལྟ་བུར་ཆོས་འཆད་དོ།
en: many hundreds of thousands of living beings conceived the spirit of unexcelled, perfect enlightenment.

source: །།དེ་ནས་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Then, the Licchavi Vimalakīrti thought to himself,

source: །བཙུན་པ་ཤཱ་རིའི་བུ་གང་དག་དེ་ལྟར་ནང་དུ་ཡང་དག་གཞག་པ་ལ་ནང་དུ་ཡང་དག་འཇོག་ན་དེ་དག་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ནང་དུ་ཡང་དག་འཇོག་པར་བཀའ་སྩལ་ཏོ་ཞེས་
en: ‘Reverend Śāriputra, those who absorb themselves in contemplation in such a way are declared by the Lord to be truly absorbed in contemplation.’

source: །མཽད་གལ་གྱི་བུས་ཀྱང་གསོལ་པ།
en: Maudgalyāyana replied,

source: བདག་གིས་མངོན་པར་འཚལ་བ་དུས་གཅིག་ན། ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོའི་སྲང་ཞིག་གི་སྒོ་ན་ཁྱིམ་བདག་རྣམས་ལ་བདག་ཆོས་སྟོན་ཅིང་
en: I remember one day when I was teaching the Dharma to the householders in a square in the great city of Vaiśālī, and

source: མཆིས་པའི་དྲུང་དེར་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་མཆིས་ནས་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: the Licchavi Vimalakīrti came along and said to me,

source: ཆོས་དེ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་བསྟན་པར་བྱ་སྟེ།
en: The Dharma must be taught according to reality.

source: ཕུལ་ནས་གདོད་བདག་གིས་བཟའ་བ་ལྟ་ན་ཇི་ལྟར་ཉོན་མོངས་པ་དང་བཅས་པ་ཡང་མ་ཡིན། ཉོན་མོངས་པ་དང་བྲལ་བ་ཡང་མ་ཡིན་པ་དེ་ལྟར་བཟའོ།
en: then you yourself may eat. Thus, when you eat, after offering, you should be neither affected by afflictions nor free of afflictions,

source: །མཉམ་པར་བཞག་པ་ཡང་མ་ཡིན། །ལངས་པ་ཡང་མ་ཡིན་པར་བཟའོ།
en: neither involved in concentration nor free of concentration,

source: །འཁོར་བ་ལའང་མི་གནས་ལ་མྱ་ངན་ལས་འདས་པ་ལ་ཡང་མི་གནས་པར་
en: neither living in the world nor abiding in liberation.

source: །བཙུན་པ་ཁྱོད་ལ་གང་དག་བསོད་སྙོམས་སྦྱིན་པར་བྱེད་པ་དེ་དག་ཀྱང་འབྲས་བུ་ཆེ་བར་ཡང་མི་འགྱུར། འབྲས་བུ་ཆུང་བར་ཡང་མི་འགྱུར།
en: Furthermore, those who give such alms, reverend, have neither great merit nor small merit,

source: བཅོམ་ལྡན་འདས་བདག་ཆོས་བསྟན་པ་འདི་ཐོས་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: Lord, when I heard this teaching, I was astonished

source: བཙུན་པ་རབ་འབྱོར་ཁྱོད་གལ་ཏེ་ཟང་ཟིང་གི་མཉམ་པ་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་རྗེས་སུ་རྟོགས་ཤིང་། ཆོས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་མཉམ་པ་ཉིད་རྗེས་སུ་རྟོགས་ན་གཟོད་བསོད་སྙོམས་འདི་ལོང་ཤིག
en: Reverend Subhūti, take this food if you understand the sameness of all things through the sameness of material objects, and if you understand the sameness of the qualities of the Buddha through the sameness of all things.

source: ཁྱོད་གལ་ཏེ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཀྱང་མ་སྤངས་ལ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་ཡང་མི་གནས།
en: if, without abandoning desire, hatred, and folly, you can avoid association with them;

source: ཁྱོད་ཀྱིས་སྟོན་པ་ཡང་མ་མཐོང་། ཆོས་ཀྱང་མ་ཐོས། དགེ་འདུན་ལའང་བསྙེན་བཀུར་མ་བྱས་ཤིང་སྟོན་པ་དྲུག་པོ་གང་ཡིན་པ་དེ་དག་
en: if, without seeing the Buddha, hearing the Dharma, or serving the Saṅgha, you undertake the religious life under the six outsider masters

source: འདི་ལྟ་སྟེ། འོད་སྲུང་རྫོགས་བྱེད་དང་། ཀུན་ཏུ་རྒྱུ་གནག་ལྷས་ཀྱི་བུ་དང་། སྨྲ་འདོད་ཀྱི་བུ་མོའི་བུ་ཡང་དག་རྒྱལ་བ་ཅན་དང་། ཀཱ་ཏྱའི་བུ་ནོག་ཅན་དང་། མི་ཕམ་སྐྲའི་ལ་བ་ཅན་དང་། གཅེར་བུ་གཉེན་གྱི་བུ་དེ་དག་བཙུན་པའི་སྟོན་པ་ཡིན་ཏེ།
en: namely, Purāṇa Kāśyapa, Māskārin Gośāli­putra, Saṃjāyin Vairaṭi­putra, Kakuda Kātyāyana, Ajita Keśakambala, and Nirgrantha Jñāti­putra, and follow the ways they prescribe.

source: དགེ་འདུན་ལ་ཡང་ཁྱོད་མི་རྟོན་ཅིང་ནམ་ཡང་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་
en: if you do not rely on the saṅgha; and finally, if you never enter ultimate liberation.

source: །བསྟན་པ་འདི་བཤད་པ་ན་ལྷའི་བུ་ཉིས་བརྒྱ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ།
en: When Vimalakīrti had discoursed in this way, two hundred gods obtained the pure doctrinal vision in regard to all things, without obscurity or defilement,

source: །ལྷའི་བུ་ལྔ་བརྒྱ་ནི་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: and five hundred gods obtained the conformative tolerance.

source: འདི་དག་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་མ་བསྟན་ཅིག
en: So do not instruct them in the disciple vehicle.

source: དེ་དག་གི་བྱང་ཆུབ་ཀྱི་སེམས་དེ་ཡང་མངོན་དུ་གྱུར་ནས་དེ་དག་སྐྱེས་བུ་དམ་པ་དེའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: As soon as their own spirits of enlightenment had become clear to them, they bowed at the feet of that good man and

source: ཐལ་མོ་སྦྱར་བར་གྱུར་པ་དང་།
en: pressed their palms together in reverence.

source: བདག་གིས་འདི་སྙམ་དུ་བསམས་སོ།
en: It occurred to me then,

source: ཉན་ཐོས་ལ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ལགས་པ་ལ་མཁས་པ་ཡང་མ་མཆིས།
en: These disciples are not expert in discerning the superiority and inferiority of the spiritual faculties of living beings,

source: །ཀཱ་ཏྱའི་བུས་ཀྱང་གསོལ་པ།
en: Kātyāyana replied,

source: བཅོམ་ལྡན་འདས་བདག་གིས་མངོན་པར་འཚལ་བ་དུས་གཅིག་ན།
en: Lord, I remember one day when,

source: མདོ་དེའི་ཚིག་གཏན་ལ་དབབ་པའི་སླད་དུ་བདག་གིས་འདི་ལྟ་སྟེ། མི་རྟག་པའི་དོན་དང་། སྡུག་བསྔལ་བའི་དོན་དང་། བདག་མེད་པའི་དོན་དང་། ཞི་བའི་དོན་གྱི་ཆོས་བསྟན་ན་
en: I was defining the expressions of that discourse by teaching the meaning of impermanence, suffering, selflessness, and peace,

source: ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་དེར་མཆིས་ནས་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: the Licchavi Vimalakīrti came there and said to me,

source: རྒྱུ་བ་དང་བཅས་པ། སྐྱེ་བ་དང་བཅས་པ་འཇིག་པ་དང་ལྡན་པའི་ཆོས་ཉིད་མ་སྟོན་ཅིག
en: do not teach an ultimate reality endowed with activity, production, and destruction!

source: གང་ཤིན་ཏུ་མ་སྐྱེས། མ་བསྐྱེད། སྐྱེད་པར་མི་འགྱུར། མ་འགགས། མི་འགག །འགག་པར་མི་འགྱུར་བ་
en: nothing was ever destroyed, is destroyed, or will ever be destroyed.

source: དེ་ནི་མི་རྟག་པའི་དོན་ཏོ།
en: Such is the meaning of “impermanence.”

source: གང་མི་འབར་བ་དེ་ནི་ཞི་བར་མི་འགྱུར་ཞིང་། གང་རབ་ཏུ་མ་ཞི་བ་དེ་ནི་ཞི་བའི་དོན་ཏོ།
en: and what does not burn is not extinguished; such lack of extinction is the meaning of “peace.”

source: མ་འགགས་པ་ཁྱོད་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའི་ནད་འདྲིར་སོང་ཤིག
en: “Aniruddha, go to the Licchavi Vimalakīrti to inquire about his illness.”

source: བདག་འཆག་ས་ཞིག་ན་འཆག་པ་དེར་ཚངས་པ་ཆེན་པོ་དགེ་བ་བཀོད་པ་ཞེས་བགྱི་བ་ཚངས་པ་ཁྲི་དང་ལྷན་ཅིག་ཕྱོགས་དེ་སྣང་བར་བགྱིས་ནས་
en: when I was taking a walk, the great Brahmā named Śubhavyūha and the ten thousand other Brahmās who accompanied him illuminated the place with their radiance and,

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པའི་ལྷའི་མིག་གིས་ཇི་སྲིད་ཚུན་ཆད་མཐོང་།
en: To what distance does the divine vision of the venerable Aniruddha extend?

source: དཔེར་ན་སྐྱེས་བུ་མིག་དང་ལྡན་པའི་ལག་མཐིལ་དུ་སྐྱུ་རུ་རའི་འབྲས་བུ་བཞག་པ་བཞིན་དུ་མཐོང་ངོ་
en: just as plainly as a man of ordinary vision sees a myrobalan nut on the palm of his hand.

source: ཞེས་བཀའ་མཆིད་འདི་བགྱིས་པ་དང་། ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་ཕྱོགས་དེར་མཆིས་ཏེ།
en: When I had said these words, the Licchavi Vimalakīrti came there and,

source: བདག་གི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་བགྱིས་ནས་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: having bowed his head at my feet, said to me,

source: །ཇི་སྟེ་མངོན་པར་འདུ་མི་བྱེད་པ་ཡིན་ན་ནི་མངོན་པར་འདུ་མི་བྱེད་པ་ནི་འདུས་མ་བྱས་པ་ཡིན་ཏེ།
en: If it is uncompounded in nature, then it is not constructed and,

source: དེས་ནི་མཐོང་བར་མི་ནུས་ན་གནས་བརྟན་གྱིས་ཇི་ལྟར་མཐོང་ཞེས་མཆི་ནས་བདག་ཅང་མི་མཆི་བར་གྱུར་ཏེ།
en: as such, is incapable of seeing. Then, how do you see, O elder?’“At these words, I became speechless,

source: འཇིག་རྟེན་ན་ལྷའི་མིག་ཅན་གང་ལགས།
en: ‘Who then, in the world, possesses the divine eye?’

source: ཉེ་བར་འཁོར་ཁྱོད་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའི་ནད་འདྲིར་སོང་ཤིག
en: Upāli, go to the Licchavi Vimalakīrti to inquire about his illness.

source: །ཉེ་བར་འཁོར་གྱིས་ཀྱང་གསོལ་པ།
en: Upāli replied,

source: དགེ་སློང་གཉིས་ཤིག་ལྟུང་བ་བྱུང་ནས་བཅོམ་ལྡན་འདས་ལ་ངོ་ཚ་སྟེ་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་མ་མཆིས་ཀྱི།
en: there were two monks who had committed some infraction and were too ashamed to appear before the Lord,

source: དེ་གཉིས་བདག་ག་ལ་བ་དེར་མཆིས་ཏེ་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: so they came to me and said,

source: །བཙུན་པ་ཉེ་བར་འཁོར་བདག་ཅག་གཉིས་ལ་ལྟུང་བ་བྱུང་སྟེ་ངོ་ཚ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་ཡང་མ་མཆིས་ན།
en: Reverend Upāli, we have both committed an infraction but are too ashamed to appear before the Buddha.

source: བཅོམ་ལྡན་འདས་བདག་དགེ་སློང་དེ་གཉིས་ལ་ཆོས་ཀྱི་གཏམ་སྟོན་པའི་
en: Lord, while I was giving those two monks some religious discourse,

source: ཕྱོགས་དེར་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པའང་མཆིས་ནས་དེ་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: the Licchavi Vimalakīrti came there and said to me,

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Why? The Buddha has said,

source: བཙུན་པ་ཉེ་བར་འཁོར་སེམས་ནི་ནང་ན་ཡང་མ་ཡིན། ཕྱི་རོལ་ན་ཡང་མ་ཡིན།
en: Reverend Upāli, the mind is neither within nor without,

source: དེ་བཞིན་གཤེགས་པ་མ་གཏོགས་པར་གང་དག་འདིའི་སྤོབས་པའི་རྒྱུན་གཅོད་ནུས་པའི་ཉན་ཐོས་སམ། བྱང་ཆུབ་སེམས་དཔའ་དེ། གང་ཡང་མེད་དེ།
en: With the exception of the Tathāgata himself, there is no disciple or bodhisattva capable of competing with his eloquence

source: །དེའི་སླད་དུ་བདག་སྐྱེས་བུ་དམ་པ་དེའི་བྲོ་འདྲི་ཞིང་མཆི་བར་མི་སྤྲོའོ།
en: Therefore, I am reluctant to go to that good man to inquire about his illness.

source: ལིད་ཙ་བཱི་གཞོན་ནུ་མང་ཞིག་བདག་ག་ལ་བ་དེར་མཆིས་ནས་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: many young Licchavi gentlemen came to the place where I was and said to me,

source: རབ་ཏུ་འབྱུང་བ་ནི་ཡོན་ཏན་མེད་ཅིང་ཕན་ཡོན་མེད་པ་ཡིན་ནོ།
en: Renunciation is itself the very absence of virtues and benefits.

source: །ཞི་གནས་དང་འཐུན་པའོ།
en: It favors mental quiescence

source: །ཐམས་ཅད་དུ་ཁ་ན་མ་ཐོ་བ་མེད་པ་སྟེ།
en: It is irreproachable in all respects and

source: དེ་ནི་རབ་ཏུ་བྱུང་བ་ཞེས་བྱ།
en: so is called renunciation.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་སྙུན་ཅིག་བྱུང་ནས།
en: the body of the Lord manifested some indisposition and

source: དེ་ལ་འོ་མ་ཞིག་འཚལ་ཏེ་
en: he required some milk;

source: །བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་སྙུན་ཅིག་བྱུང་སྟེ་དེ་ལ་འོ་མ་ཞིག་དགོས་ནས་དེ་ཚོལ་ལོ་ཞེས་བགྱིས་པ་དང་།
en: ‘The body of the Lord manifests some indisposition, and he needs some milk. Therefore, I have come to fetch some.’

source: །བཙུན་པ་ཀུན་དགའ་བོ་ཁོ་བོ་ངོ་ཚ་བར་མ་བྱ་བར་སླར་སོང་ཤིག
en: Reverend Ānanda, do not bring shame upon us, but go in silence,

source: །གཞན་མུ་སྟེགས་ཅན་སྤྱོད་པ་པ་དང་། ཀུན་ཏུ་རྒྱུ་དང་། གཅེར་བུ་པ་དང་། འཚོ་བ་པ་དག་གིས་ཐོས་ས་རེ།
en: lest the outsider sectarians should hear your words.

source: ཀྱེ་མའོ་འདི་དག་གི་སྟོན་པ་ནི་བདག་ཉིད་ཀྱང་ན་བ་ལས་སྐྱོབ་མི་ནུས་ན། སེམས་ཅན་ན་བ་དག་གི་སྐྱབས་ལྟ་ག་ལ་ནུས་སྙམ་དུ་སེམས་ས་རེ།
en: For shame! The teacher of these people cannot even cure his own sicknesses. How then can he cure the sicknesses of others?

source: །དེ་བཞིན་དུ་ཉན་ཐོས་ལྔ་བརྒྱ་ཙམ་མི་སྤྲོ་བར་གྱུར་པ་དེ་དག་གིས་རང་གི་སྤོབས་པ་
en: In the same way, the rest of the five hundred disciples were reluctant

source: གང་དག་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་དང་གཏམ་བྱས་པ་དེ་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ལ་གསོལ་ཏོ།
en: and each told the Buddha his own adventure, recounting all his conversations with the Licchavi Vimalakīrti.

source: ལྷའི་བུ་ཡོངས་སུ་དགའ་ལྡན་ལ་སོགས་པ་དགའ་ལྡན་རིགས་ཀྱི་ལྷའི་བུ་རྣམས་དང་ལྷན་ཅིག་ཏུ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་བརྩམས་ཏེ་ཆོས་ཀྱི་བཀའ་མཆིད་མཆི་བའི་
en: one day I was engaged in a conversation with the gods of the Tuṣita heaven, the god Saṃtuṣita and his retinue, about the stage of nonregression of the great bodhisattvas. At that time,

source: ཕྱོགས་དེར་ལིད་ཙ་བཱི་དྲི་མ་མེད་པར་གྲགས་པ་མཆིས་ཏེ། དེ་བདག་ལ་འདི་སྐད་ཅེས་མཆིའོ།
en: the Licchavi Vimalakīrti came there and addressed me as follows:

source: བྱམས་པ་ཅི་འདས་པས་སམ། འོན་ཏེ་མ་འོངས་པས་སམ། འོན་ཏེ་ད་ལྟར་གྱིས་དེ་ལ་གང་
en: Is it past? Is it future? Or is it present?

source: འདས་པའི་སྐྱེས་པ་དེ་ནི་ཟད་པའོ།
en: If it is a past birth, it is already finished.

source: །གང་མ་འོངས་པ་དེ་ནི་མ་ཕྱིན་པའོ།
en: If it is a future birth, it will never arrive.

source: །ད་ལྟར་གྱི་སྐྱེ་བ་ལ་ནི་གནས་པའང་མེད་དེ།
en: If it is a present birth, it does not abide.

source: འདི་ལྟ་སྟེ། བཅོམ་ལྡན་ཀྱིས་བཀའ་སྩལ་པ།
en: For the Buddha has declared,

source: བྱམས་པ་ཁྱོད་དེ་བཞིན་ཉིད་སྐྱེ་བས་སམ། དེ་བཞིན་ཉིད་འགག་པས་སམ།
en: Therefore, Maitreya, is your reality from birth? Or is it from cessation?

source: གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དང་གང་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དང་། གང་འཕགས་པ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་དེ་ནི་བྱམས་པ་ཁྱོད་ཀྱི་ཡང་དེ་བཞིན་ཉིད་དོ།
en: Furthermore, your reality is just the same as the reality of all living beings, the reality of all things, and the reality of all the holy ones.

source: དེ་བཞིན་ཉིད་ནི་གཉིས་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན། ཐ་དད་པས་རབ་ཏུ་ཕྱེ་བ་མ་ཡིན་པའི་ཕྱིར་ཏེ།
en: Because reality does not consist of duality or of diversity.

source: སེམས་ཅན་ཐམས་ཅད་རྗེས་སུ་རྟོགས་པ་ནི་བྱང་ཆུབ་ཡིན་པའི་ཕྱིར་རོ།
en: Enlightenment consists of the realizations of all living beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པར་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་སྟེ།
en: The tathāgatas do not enter ultimate liberation until all living beings have entered ultimate liberation.

source: །བྱང་ཆུབ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་དང་། བསམ་པ་ཡོངས་སུ་ཤེས་པའོ།
en: Enlightenment is the complete knowledge of the thoughts, deeds, and inclinations of all living beings.

source: ལུས་ནི་རྩྭ་དང་ཤིང་དང་། རྩིག་པ་དང་། ལམ་དང་། མིག་ཡོར་ལྟ་བུའོ།
en: The body is like grass, trees, walls, paths, and optical illusions.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་ལྡན་པ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་དང་ལྡན་པ་དང་། དགེ་བའི་རྩ་བ་དང་ལྡན་པའི་གོམ་པ་འདོར་བ་དང་། འདེག་པ་
en: the roots of virtue, the ability to develop living beings, and the incorporation of the holy Dharma, whether they lift up their feet or put them down,

source: དེ་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ནས་འོངས་སོ།
en: they all come from the seat of enlightenment.

source: བདུད་སྡིག་ཅན་ལྷའི་བུ་མོ་ཁྲི་ཉིས་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཏེ། བརྒྱ་བྱིན་གྱི་ཆ་བྱད་ཀྱིས་
en: the wicked Māra, disguised as Indra and surrounded with twelve thousand heavenly maidens,

source: སིལ་སྙན་དང་གླུ་དབྱངས་ལེན་ཅིང་བདག་ག་ལ་བ་དེར་མཆིས་ཏེ།
en: approached me with the sounds of music and singing.

source: སངས་རྒྱས་ལ་མི་ཕྱེད་པར་དད་ཅིང་དགའ་བ་དང་། ཆོས་ཉན་པར་འདོད་ཅིང་དགའ་བ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱ་བར་དགའ་བ་དང་། ང་རྒྱལ་མེད་ཅིང་བླ་མ་དག་ལ་བསྟི་སྟང་བྱེད་པར་དགའ་བ་དང་།
en: It is the joy of unbreakable faith in the Buddha, of wishing to hear the Dharma, of serving the Saṅgha and honoring the spiritual benefactors without pride.

source: ཁམས་ཀུན་ནས་འབྱུང་བར་དགའ་བ་དང་། ཡུལ་རྣམས་ལ་མི་གནས་པར་དགའ་བ་དང་། ཕུང་པོ་རྣམས་ལ་གཤེད་མ་ལྟ་བུར་རྟོག་པ་ལ་དགའ་བ་དང་། ཁམས་རྣམས་ལ་སྦྲུལ་གདུག་པ་དང་མཚུངས་པར་རྟོག་པ་ལ་དགའ་བ་དང་། སྐྱེ་མཆེད་རྣམས་ལ་གྲོང་སྟོང་པ་ལྟ་བུར་དབེན་པར་དགའ་བ་དང་།
en: It is the joy of renunciation of the whole world, of not being fixed in objects, of considering the five aggregates to be like murderers, of considering the elements to be like venomous serpents, and of considering the sense-media to be like an empty town.
